whyWeMadeMessage = """ 
                                    개발자 : 강희구, 권부연

저희는 우리말로 쓰였지만 이해가 힘든 문장들을 교정하기 위한 프로그램을 만들기 위해 이번 문장교정기를 제작했습니다.

종종 글을 읽다보면 우리는 무슨 말인지는 알겠지만 깔끔한 문장이라고 느끼기엔 무리가 있는 문장들을 발견하곤 합니다.
하지만 시중에 많은 번역기와 달리 시중에 우리말 문장을 깔끔하게 수정해주는 프로그램이나 교정기는 찾기 힘든 상황입니다. 
그래서 저희는 그런 문장들을 깔끔한 문장으로 수정하기 위한 수정 방향을 제안해주는 교정기를 제작했습니다.

문장을 깔끔하지 않게 하는 원인으로 틀린 문법을 포함하여 많은 것들이 있습니다.
그 중 저희는 그 중 외국어 번역투때문에 생기는 문제들을 집중적으로 수정합니다. 

한 가지 예시를 들면
    둘리 : 부장님이 사장님 심기 건드렸다고 혼났어 골프채 가방을 넘어뜨렸나봐.
    또치 : 1. 그는 그러는거 매우 싫어하시잖아(He really hates it)
              2. 사장님께선 그러는거 매우 싫어하시잖아
              3. 그러는거 매우 싫어하시잖아.
위에서 또치의 대답들을 읽어보면 1번 대답의 영어 인칭 대명사'He'를 그대로 직역한 표현을 쓴 문장보다 
명사로 환원해 말한 2번이나 과감히 주어를 생략한 3번이 더 자연스럽다고 느낄 것입니다.
그 이유는 '그/그녀'라는 표현은 원래 우리말에 있던 말이 아니라 외국어를 번역하며 생긴 말이기도 하고 
우리말의 '구어(口語)'에서는 뜻을 유추할 수 있으면 대명사는 사용하지 않는 것이 자연스럽기때문입니다.

저희의 문장교정기는 위와 같은 상황처럼 문장을 보다 더 깔끔하게 수정할 방향을 제안해줍니다.
"""

howToUseMessage = """1. '수정할 문장' 칸에 수정하고 싶은 문장을 입력합니다.

2.  문장을 입력하면 아래 '수정할 표현' 칸에서 수정할 표현들을 알려줍니다.

3. 아래 '이렇게 수정' 칸에서는 수정을 어떻게 하면 좋을지를 사용자에게 제안합니다.
"""